rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/crypto/Esp32DriverCryptoEd25519.c
    // Montgomery ladder, multiplication, constant time
    for (int m = 252; m >= 0; --m) {
        if (0 == ESP32_BN_Get_Bit(k, m, LTSYSTEMCRYPTO_U32_PER_U256)) {
            ESP32_Ext_Add(ctx, &mb->r1, res, &mb->r1, &mb->eb);
            ESP32_Ext_Double(ctx, res, res, &mb->eb);
        } else {
            ESP32_Ext_Add(ctx, res, res, &mb->r1, &mb->eb);
            ESP32_Ext_Double(ctx, &mb->r1, &mb->r1, &mb->eb);
        }
    }
}

/**
 * @brief res = k*a, extended homogeneous point multiplication
 *        Use only in public key generation
 * @param res  the resulting product
 * @param k    the scalar to multiply
 * @param a    the extended point to multiply
 * @param mb   a temporary buffer for computation
 * @note  use this multiplication only if k < L, L = 2^252+xxx
 */
static void ESP32_Ext_Multiply_Normal(const ESP32_RSA_CTX *ctx, EdPointExt *res, const u256 k, const EdPointExt *a, struct Esp32C25519ExMulLocal *mb) {
    lt_memcpy(&mb->r1, a, sizeof(EdPointExt));

    lt_memset(res, 0, sizeof(EdPointExt));
    res->Y[0] = 1;
    res->Z[0] = 1;

    for (int m = 252; m >= 0; --m) {
        ESP32_Ext_Double(ctx, res, res, &mb->eb);
        if (1 == ESP32_BN_Get_Bit(k, m, LTSYSTEMCRYPTO_U32_PER_U256)) {
            ESP32_Ext_Add(ctx, res, res, &mb->r1, &mb->eb);
        }
    }
}

/**
 * @brief res = u*a + v*b, extended homogeneous point multiplication and addition
 *        Use only in signature verification
 * @param res  the resulting product
 * @param k    the scalar to multiply
 * @param a    the extended point to multiply
 * @param mb   a temporary buffer for computation
 * @note  use this multiplication only if k < L, L = 2^252+xxx
 */
static void ESP32_Ext_Multiply_Add(const ESP32_RSA_CTX *ctx, EdPointExt *res, const u256 u, const EdPointExt *a, const u256 v, const EdPointExt *b, struct Esp32C25519ExMulLocal *mb) {
    lt_memset(&mb->r0, 0, sizeof(EdPointExt));
    mb->r0.Y[0] = 1;
    mb->r0.Z[0] = 1;
    ESP32_Ext_Add(ctx, &mb->r1, a, b, &mb->eb);

    int ub, vb;
    for (int m = 252; m >= 0; --m) {
        ESP32_Ext_Double(ctx, &mb->r0, &mb->r0, &mb->eb);
        ub = ESP32_BN_Get_Bit(u, m, LTSYSTEMCRYPTO_U32_PER_U256);
        vb = ESP32_BN_Get_Bit(v, m, LTSYSTEMCRYPTO_U32_PER_U256);
        if (ub == 0 && vb == 1) {
            ESP32_Ext_Add(ctx, &mb->r0, &mb->r0, b, &mb->eb);
        } else if (ub == 1 && vb == 0) {
            ESP32_Ext_Add(ctx, &mb->r0, &mb->r0, a, &mb->eb);
        } else if (ub == 1 && vb == 1) {
            ESP32_Ext_Add(ctx, &mb->r0, &mb->r0, &mb->r1, &mb->eb);
        }
    }
    lt_memcpy(res, &mb->r0, sizeof(EdPointExt));
}

/**
 * @brief Point multiplication on the Ed curve
 *        Use in signature generation, constant time
 * @param res  the resulting point
 * @param k    the scalar to multiply
 * @param a    the point to multiply
 * @param mb   a temporary buffer for computation
 * @note  use this multiplication only if k < L, L = 2^252+xxx
 */
static void ESP32_Ed_Multiply_Const(const ESP32_RSA_CTX *ctx, EdPoint *res, const u256 k, const EdPoint *a, struct Esp32C25519EdMulLocal *mb) {
    // map the base point to an extended homogeneous point
    ESP32_Ed_To_Ext(ctx, &mb->P, a);

    // multiply in extended homogeneous space
    ESP32_Ext_Multiply_Const(ctx, &mb->P, k, &mb->P, &mb->mb);

    // map back to Edward point
    ESP32_Ext_To_Ed(ctx, res, &mb->P, &mb->eb);
}

/**
 * @brief Point multiplication on the Ed curve
 *        Use only in public key generation
 * @param res  the resulting point
 * @param k    the scalar to multiply
 * @param a    the point to multiply
 * @param mb   a temporary buffer for computation
 * @note  use this multiplication only if k < L, L = 2^252+xxx
 */
static void ESP32_Ed_Multiply_Normal(const ESP32_RSA_CTX *ctx, EdPoint *res, const u256 k, const EdPoint *a, struct Esp32C25519EdMulLocal *mb) {
    // map the base point to an extended homogeneous point
    ESP32_Ed_To_Ext(ctx, &mb->P, a);

    // multiply in extended homogeneous space
    ESP32_Ext_Multiply_Normal(ctx, &mb->P, k, &mb->P, &mb->mb);

    // map back to Edward point
    ESP32_Ext_To_Ed(ctx, res, &mb->P, &mb->eb);
}

/**
 * @brief  Square root to get x, using u and v. A helper function to LT_Ed_Decode
 *         x = u * v^3 * (u * v^7) ^ (N-5)/8
 * @param res the resulting x coordinate
 * @param u   the u operand
 * @param v   the v operand
 * @return result code
 */
static LTSystemCryptoResult ESP32_Sqrt_ModN(const ESP32_RSA_CTX *ctx, u256 res, u256 u, u256 v) {
    struct SqrtLocal {
        u256 r0;
        u256 v3;
    };
    struct SqrtLocal *tmp = lt_malloc(sizeof(struct SqrtLocal));
    if (!tmp) return kLTSystemCrypto_Result_OOM;

    ESP32_BN_Multiply_Mod_Preset(ctx, tmp->r0, v, v);   // r0 = v^2
    ESP32_BN_Multiply_Mod_Preset(ctx, tmp->v3, tmp->r0, v);  // v3 = v^3
    ESP32_BN_Multiply_Mod_Preset(ctx, tmp->r0, tmp->r0, tmp->r0); // r0 = v^4
    ESP32_BN_Multiply_Mod_Preset(ctx, tmp->r0, tmp->r0, tmp->v3); // r0 = v^7

    // (N-5)/8 = 0xffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffd
    // 250 '1', then '0', then '1'
    // r0 = (u * v^7) ^ (N-5)/8 % N
    ESP32_BN_Multiply_Mod_Preset(ctx, tmp->r0, u, tmp->r0);   // r0 = u * v^7
    ESP32_BN_Pow_Mod_Preset(ctx, tmp->r0, tmp->r0, kEd25519_N58);

    // x = r0 * u * v^3 % N
    ESP32_BN_Multiply_Mod_Preset(ctx, tmp->r0, tmp->r0, u);
    ESP32_BN_Multiply_Mod_Preset(ctx, res, tmp->r0, tmp->v3);

    // r0 = v * x^2 % N
    ESP32_BN_Multiply_Mod_Preset(ctx, tmp->r0, res, res);
    ESP32_BN_Multiply_Mod_Preset(ctx, tmp->r0, tmp->r0, v);

    LTSystemCryptoResult ret = kLTSystemCrypto_Result_Ok;
    if (ESP32_BN_Compare_Unsigned(tmp->r0, u, LTSYSTEMCRYPTO_U32_PER_U256) != 0) {
        // x = x * 2^((N-1)/4) % N
        ESP32_BN_Multiply_Mod_Preset(ctx, res, res, kEd25519_SQ);
        // r0 = v * x^2 % N
        ESP32_BN_Multiply_Mod_Preset(ctx, tmp->r0, res, res);
        ESP32_BN_Multiply_Mod_Preset(ctx, tmp->r0, tmp->r0, v);
        if (ESP32_BN_Compare_Unsigned(tmp->r0, u, LTSYSTEMCRYPTO_U32_PER_U256) != 0) {
            ret = kLTSystemCrypto_Result_WrongVerification;
        }
    }

    lt_memset(tmp, 0, sizeof(struct SqrtLocal));
    lt_free(tmp);
    return ret;
}

// 5.1.3
/**
 * @brief Decode the y coordinate to the full Ed point on the curve
 * @param  res the resulting point
 * @param  y    the y coordinate
 * @return result code
 * @note   y includes the true y and the lsb of x
 */
static LTSystemCryptoResult ESP32_Ed_Decode(const ESP32_RSA_CTX *ctx, EdPoint *res, const u256 y) {
    struct DecodeLocal {
        u256 one;
        u256 u;
        u256 v;
    };
    struct DecodeLocal *tmp = lt_malloc(sizeof(struct DecodeLocal));
    if (!tmp) return kLTSystemCrypto_Result_OOM;

    lt_memcpy(res->y, y, LTSYSTEMCRYPTO_BYTES_PER_U256);
    // step 1
    u32 xlsb = res->y[LTSYSTEMCRYPTO_U32_PER_U256 - 1] >> 31;
    res->y[LTSYSTEMCRYPTO_U32_PER_U256 - 1] &= 0x7FFFFFFF;
    if (ESP32_BN_Compare_Unsigned(res->y, Esp32_GetC25519_N(), LTSYSTEMCRYPTO_U32_PER_U256) >= 0) {
        return kLTSystemCrypto_Result_WrongVerification;
    }

    // step 2
    lt_memset(tmp->one, 0, LTSYSTEMCRYPTO_BYTES_PER_U256);
    tmp->one[0] = 1;
    // u = y^2 - 1
    ESP32_BN_Multiply_Mod_Preset(ctx, tmp->v, res->y, res->y);
    ESP32_BN_Subtract_Mod_Unsigned(tmp->u, tmp->v, tmp->one, Esp32_GetC25519_N(), LTSYSTEMCRYPTO_U32_PER_U256);
    // v = d*y^2 + 1
    ESP32_BN_Multiply_Mod_Preset(ctx, tmp->v, tmp->v, kEd25519_d);
    ESP32_BN_Add_Mod_Unsigned(tmp->v, tmp->v, tmp->one, Esp32_GetC25519_N(), LTSYSTEMCRYPTO_U32_PER_U256);

    // step 3, x = u * v^3 * (u * v^7) ^ (N-5)/8 % N
    LTSystemCryptoResult ret = ESP32_Sqrt_ModN(ctx, res->x, tmp->u, tmp->v);
    if (kLTSystemCrypto_Result_Ok == ret) {
        // step 4
        if ((res->x[0] & 1) != xlsb) {
            ESP32_BN_Subtract_Unsigned(res->x, Esp32_GetC25519_N(), res->x, LTSYSTEMCRYPTO_U32_PER_U256);
        }
    }

    lt_memset(tmp, 0, sizeof(struct DecodeLocal));
    lt_free(tmp);
    return ret;
}

// 5.1.5
/**
 * @brief  Initialize the EdDSA context
 * @param  ctx     the context
 * @param  privKey  the private key, 32 Bytes
 * @return result code
 */
static LTSystemCryptoResult ESP32_Eddsa_Init(ESP32_EdDSA_CTX *ctx, const u8 privKey[EdDSA_KEY_LENGTH]) {
    if (!ctx || !privKey) {
        return kLTSystemCrypto_Result_Null;
    }

    struct InitLocal {
        u256 k;
        EdPoint P;
        ESP32_RSA_CTX rsaCtx;
        struct Esp32C25519EdMulLocal edmb;
    };
    struct InitLocal *tmp = lt_malloc(sizeof(struct InitLocal));
    if (!tmp) return kLTSystemCrypto_Result_OOM;

