rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/crypto/Esp32DriverCryptoEd25519.c
    lt_memset(ctx, 0, sizeof(ESP32_EdDSA_CTX));

    // step 1
    ESP32_SHA512_Digest(privKey, LTSYSTEMCRYPTO_BYTES_PER_U256, ctx->secret);
    // step 2
    ctx->secret[0] &= 0xF8;    // clear 3 lsbs
    ctx->secret[31] &= 0x7F;   // clear 1 msb
    ctx->secret[31] |= 0x40;   // set the 2nd msb
    // step 3
    ESP32_BN_Mod_HW(tmp->k, ctx->s, LTSYSTEMCRYPTO_U32_PER_U256, kC25519_L, kC25519_Q2, LTSYSTEMCRYPTO_U32_PER_U256, kC25519_L1, LTSYSTEMCRYPTO_RSA512LEN);
    ESP32_BN_Set_Mod(&tmp->rsaCtx, Esp32_GetC25519_N(), Esp32_GetC25519_R2(), LTSYSTEMCRYPTO_U32_PER_U256, Esp32_GetC25519_N1(), LTSYSTEMCRYPTO_RSA512LEN);
    ESP32_Ed_Multiply_Normal(&tmp->rsaCtx, &tmp->P, tmp->k, &kEd25519_BP, &tmp->edmb);
    lt_memset(tmp->k, 0, sizeof(tmp->k));
    ESP32_BN_ClearRSA(LTSYSTEMCRYPTO_RSA512LEN);
    // step 4, public key A[32], i.e. pubKey[32]
    lt_memcpy(ctx->pubKey, tmp->P.y, LTSYSTEMCRYPTO_BYTES_PER_U256);
    ctx->pubKey[31] |= ((tmp->P.x[0] & 1) << 7);

    lt_memset(tmp, 0, sizeof(struct InitLocal));
    lt_free(tmp);
    return kLTSystemCrypto_Result_Ok;
}

static LTSystemCryptoResult ESP32_Eddsa_GenPublicKey(const u8 privateKey[EdDSA_KEY_LENGTH], u8 publicKey[EdDSA_KEY_LENGTH]) {
    ESP32_EdDSA_CTX *ctx = lt_malloc(sizeof(ESP32_EdDSA_CTX));
    if (!ctx) return kLTSystemCrypto_Result_OOM;
    LTSystemCryptoResult ret = ESP32_Eddsa_Init(ctx, privateKey);
    if (kLTSystemCrypto_Result_Ok == ret) lt_memcpy(publicKey, ctx->pubKey, EdDSA_KEY_LENGTH);
    lt_memset(ctx, 0, sizeof(ESP32_EdDSA_CTX));
    lt_free(ctx);
    return ret;
}

// 5.1.6
/**
 * @brief  Sign a block of data to produce a signature
 * @param  ctx       the context
 * @param  data      the data
 * @param  dataLen   the length of data
 * @param  signature  the output signature
 * @param  pubKey     the output public key, used later for verifying signature
 * @return result code
 */
static LTSystemCryptoResult ESP32_Eddsa_Sign(const ESP32_EdDSA_CTX *ctx, const u8 *data, LT_SIZE dataLen, u8 signature[EdDSA_SIGNATURE_LENGTH], u8 pubKey[EdDSA_KEY_LENGTH]) {
    // sanity check
    if (!ctx || !pubKey || !data || !signature) {
        return kLTSystemCrypto_Result_Null;
    }

    struct SignLocal {
        u256 r;
        u256 k;
        u8 h[SHA512_HASH_LENGTH];
        ESP32_SHA512_CTX shaCtx;
        EdPoint P;
        ESP32_RSA_CTX rsaCtx;
        struct Esp32C25519EdMulLocal edmb;
    };
    struct SignLocal *tmp = lt_malloc(sizeof(struct SignLocal));
    if (!tmp) return kLTSystemCrypto_Result_OOM;

    // step 1, 5.1.5, init to generate keys in context
    lt_memcpy(pubKey, ctx->pubKey, EdDSA_KEY_LENGTH);

    // step 2
    ESP32_SHA512_Init(&tmp->shaCtx);
    ESP32_SHA512_Update(&tmp->shaCtx, ctx->prefix, LTSYSTEMCRYPTO_BYTES_PER_U256);
    ESP32_SHA512_Update(&tmp->shaCtx, data, dataLen);
    ESP32_SHA512_Finish(&tmp->shaCtx, tmp->h);

    // step 3, string R[32]
    ESP32_BN_Mod_HW(tmp->r, (u32 *)tmp->h, LTSYSTEMCRYPTO_U32_PER_U256 * 2, kC25519_L, kC25519_Q2, LTSYSTEMCRYPTO_U32_PER_U256, kC25519_L1, LTSYSTEMCRYPTO_RSA512LEN);
    ESP32_BN_Set_Mod(&tmp->rsaCtx, Esp32_GetC25519_N(), Esp32_GetC25519_R2(), LTSYSTEMCRYPTO_U32_PER_U256, Esp32_GetC25519_N1(), LTSYSTEMCRYPTO_RSA512LEN);
    ESP32_Ed_Multiply_Const(&tmp->rsaCtx, &tmp->P, tmp->r, &kEd25519_BP, &tmp->edmb);
    ESP32_BN_ClearRSA(LTSYSTEMCRYPTO_RSA512LEN);
    lt_memcpy(tmp->h, tmp->P.y, LTSYSTEMCRYPTO_BYTES_PER_U256);
    tmp->h[31] |= ((tmp->P.x[0] & 1) << 7);
    lt_memcpy(signature, tmp->h, LTSYSTEMCRYPTO_BYTES_PER_U256);   // step 6, R is h, the first half of signature

    // step 4
    ESP32_SHA512_Init(&tmp->shaCtx);
    ESP32_SHA512_Update(&tmp->shaCtx, tmp->h, LTSYSTEMCRYPTO_BYTES_PER_U256);
    ESP32_SHA512_Update(&tmp->shaCtx, ctx->pubKey, LTSYSTEMCRYPTO_BYTES_PER_U256);
    ESP32_SHA512_Update(&tmp->shaCtx, data, dataLen);
    ESP32_SHA512_Finish(&tmp->shaCtx, tmp->h);
    ESP32_BN_Mod_HW(tmp->k, (u32*)tmp->h, LTSYSTEMCRYPTO_U32_PER_U256 * 2, kC25519_L, kC25519_Q2, LTSYSTEMCRYPTO_U32_PER_U256, kC25519_L1, LTSYSTEMCRYPTO_RSA512LEN);

    // step 5
    ESP32_BN_Multiply_Mod_HW(tmp->k, tmp->k, ctx->s, kC25519_L, kC25519_Q2, LTSYSTEMCRYPTO_U32_PER_U256, kC25519_L1, LTSYSTEMCRYPTO_RSA512LEN);
    ESP32_BN_Add_Mod_Unsigned(tmp->r, tmp->r, tmp->k, kC25519_L, LTSYSTEMCRYPTO_U32_PER_U256);

    // step 6
    lt_memcpy(signature + 32, tmp->r, LTSYSTEMCRYPTO_BYTES_PER_U256);  // the second half of signature

    lt_memset(tmp, 0, sizeof(struct SignLocal));
    lt_free(tmp);
    return kLTSystemCrypto_Result_Ok;
}

// 5.1.7
/**
 * @brief  Verify a signature
 * @param  data      the data of the signature
 * @param  dataLen   the length of data
 * @param  signature  the signature to verify
 * @param  pubKey     the public key for verifying signature
 * @return result code
 */
static LTSystemCryptoResult ESP32_Eddsa_Verify(const u8 *data, LT_SIZE dataLen, const u8 signature[EdDSA_SIGNATURE_LENGTH], const u8 pubKey[EdDSA_KEY_LENGTH]) {
    // sanity check
    if (!pubKey || !signature || !data) {
        return kLTSystemCrypto_Result_Null;
    }

    struct VerifyLocal {
        u32 buf[LTSYSTEMCRYPTO_U32_PER_U256];
        u32 h[SHA512_HASH_LENGTH / 4];
        u256 s;
        union {
            ESP32_SHA512_CTX ctx;
            struct {
                EdPointExt left;  // left and right extended points
                EdPointExt right;
                EdPoint A;
                ESP32_RSA_CTX rsaCtx;
                // shared temporary buffer for sub function calls
                union {
                    struct Esp32C25519ExMulLocal emb;
                    struct Esp32C25519ExtLocal eb;
                };
            };
        };
    };
    struct VerifyLocal *tmp = lt_malloc(sizeof(struct VerifyLocal));
    if (!tmp) return kLTSystemCrypto_Result_OOM;

    LTSystemCryptoResult ret = kLTSystemCrypto_Result_Error;
    do {
        lt_memcpy(tmp->buf, signature + LTSYSTEMCRYPTO_BYTES_PER_U256, LTSYSTEMCRYPTO_BYTES_PER_U256);
        if (ESP32_BN_Compare_Unsigned(tmp->buf, kC25519_L, LTSYSTEMCRYPTO_U32_PER_U256) >=0) {
            ret = kLTSystemCrypto_Result_WrongVerification;
            break;
        }

        // 5.1.7
        // step 2
        ESP32_SHA512_Init(&tmp->ctx);
        ESP32_SHA512_Update(&tmp->ctx, signature, LTSYSTEMCRYPTO_BYTES_PER_U256);
        ESP32_SHA512_Update(&tmp->ctx, pubKey, LTSYSTEMCRYPTO_BYTES_PER_U256);
        ESP32_SHA512_Update(&tmp->ctx, data, dataLen);
        ESP32_SHA512_Finish(&tmp->ctx, (u8 *)tmp->h);
        u32 *k = tmp->h;         // secrete scalar k[32]
        ESP32_BN_Mod_HW(k, tmp->h, LTSYSTEMCRYPTO_U32_PER_U256 * 2, kC25519_L, kC25519_Q2, LTSYSTEMCRYPTO_U32_PER_U256, kC25519_L1, LTSYSTEMCRYPTO_RSA512LEN);

        // step 1
        // step 3, [s]B = R + [k]A
        // check in extended space to avoid Ext_To_Ed computation
        ESP32_BN_Set_Mod(&tmp->rsaCtx, Esp32_GetC25519_N(), Esp32_GetC25519_R2(), LTSYSTEMCRYPTO_U32_PER_U256, Esp32_GetC25519_N1(), LTSYSTEMCRYPTO_RSA512LEN);
        // left is B
        ESP32_Ed_To_Ext(&tmp->rsaCtx, &tmp->left, &kEd25519_BP);
        // right is A
        lt_memcpy(tmp->buf, pubKey, LTSYSTEMCRYPTO_BYTES_PER_U256);
        if (kLTSystemCrypto_Result_Ok != (ret = ESP32_Ed_Decode(&tmp->rsaCtx, &tmp->A, tmp->buf))) break;
        ESP32_Ed_To_Ext(&tmp->rsaCtx, &tmp->right, &tmp->A);
        // s
        lt_memcpy(tmp->s, signature + LTSYSTEMCRYPTO_BYTES_PER_U256, LTSYSTEMCRYPTO_BYTES_PER_U256);
        // -k
        lt_memset(tmp->buf, 0, LTSYSTEMCRYPTO_BYTES_PER_U256);
        ESP32_BN_Subtract_Mod_Unsigned(tmp->buf, tmp->buf, k, kC25519_L, LTSYSTEMCRYPTO_U32_PER_U256);
        // [s]B - [k]A
        ESP32_Ext_Multiply_Add(&tmp->rsaCtx, &tmp->left, tmp->s, &tmp->left, tmp->buf, &tmp->right, &tmp->emb);

        lt_memcpy(tmp->buf, signature, LTSYSTEMCRYPTO_BYTES_PER_U256);
        if (kLTSystemCrypto_Result_Ok != (ret = ESP32_Ed_Decode(&tmp->rsaCtx, &tmp->A, tmp->buf))) break;
        ESP32_Ed_To_Ext(&tmp->rsaCtx, &tmp->right, &tmp->A);

        u32 *r = tmp->h + LTSYSTEMCRYPTO_U32_PER_U256;   // l is k
        // lx = lX/lZ == rX/rZ = rx. Hence, lX*rZ == lZ*rX % N
        ESP32_BN_Multiply_Mod_Preset(&tmp->rsaCtx, k, tmp->left.X, tmp->right.Z);
        ESP32_BN_Multiply_Mod_Preset(&tmp->rsaCtx, r, tmp->left.Z, tmp->right.X);
        if (ESP32_BN_Compare_Unsigned(k, r, LTSYSTEMCRYPTO_U32_PER_U256) != 0) {
            ret = kLTSystemCrypto_Result_WrongVerification;
            break;
        }
        // ly = lY/lZ == rY/rZ = ry. Hence, lY*rZ == lZ*rY % N
        ESP32_BN_Multiply_Mod_Preset(&tmp->rsaCtx, k, tmp->left.Y, tmp->right.Z);
        ESP32_BN_Multiply_Mod_Preset(&tmp->rsaCtx, r, tmp->left.Z, tmp->right.Y);
        if (ESP32_BN_Compare_Unsigned(k, r, LTSYSTEMCRYPTO_U32_PER_U256) != 0) {
            ret = kLTSystemCrypto_Result_WrongVerification;
            break;
        }
    } while (0);

