rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/crypto/Esp32DriverCryptoEd25519.c
    ESP32_BN_ClearRSA(LTSYSTEMCRYPTO_RSA512LEN);
    lt_memset(tmp, 0, sizeof(struct VerifyLocal));
    lt_free(tmp);
    return ret;
}

typedef_LTObjectImpl(LTDriverCryptoEd25519, LTHardwareCryptoEd25519) {
} LTOBJECT_API;

static LTSystemCryptoResult LTHardwareCryptoEd25519_GenPublicKey(const u8 privateKey[EdDSA_KEY_LENGTH], u8 publicKey[EdDSA_KEY_LENGTH]) {
    Esp32DriverCrypto_LockShaMutex();
    ESP32_SHA_Enable();
    ESP32_RSA_Enable();
    LTSystemCryptoResult ret = ESP32_Eddsa_GenPublicKey(privateKey, publicKey);
    ESP32_RSA_Disable();
    ESP32_SHA_Disable();
    Esp32DriverCrypto_UnlockShaMutex();
    return ret;
}

static LTSystemCryptoResult LTHardwareCryptoEd25519_Sign(const u8 priKey[EdDSA_KEY_LENGTH], const u8 *data, LT_SIZE dataLen, u8 signature[EdDSA_SIGNATURE_LENGTH], u8 pubKey[EdDSA_KEY_LENGTH]) {
    ESP32_EdDSA_CTX *eddsaCtx = lt_malloc(sizeof(ESP32_EdDSA_CTX));
    if (!eddsaCtx) return kLTSystemCrypto_Result_OOM;
    Esp32DriverCrypto_LockShaMutex();
    ESP32_SHA_Enable();
    ESP32_RSA_Enable();
    LTSystemCryptoResult ret = kLTSystemCrypto_Result_Error;
    do {
        if (kLTSystemCrypto_Result_Ok != (ret = ESP32_Eddsa_Init(eddsaCtx, priKey))) {
            break;
        }
        ret = ESP32_Eddsa_Sign(eddsaCtx, data, dataLen, signature, pubKey);
    } while (false);
    ESP32_RSA_Disable();
    ESP32_SHA_Disable();
    Esp32DriverCrypto_UnlockShaMutex();
    lt_memset(eddsaCtx, 0, sizeof(ESP32_EdDSA_CTX));
    lt_free(eddsaCtx);
    return ret;
}

static LTSystemCryptoResult LTHardwareCryptoEd25519_Verify(const u8 *data, LT_SIZE dataLen, const u8 signature[EdDSA_SIGNATURE_LENGTH], const u8 pubKey[EdDSA_KEY_LENGTH]) {
    Esp32DriverCrypto_LockShaMutex();
    ESP32_SHA_Enable();
    ESP32_RSA_Enable();
    LTSystemCryptoResult ret = ESP32_Eddsa_Verify(data, dataLen, signature, pubKey);
    ESP32_RSA_Disable();
    ESP32_SHA_Disable();
    Esp32DriverCrypto_UnlockShaMutex();
    return ret;
}

static void LTHardwareCryptoEd25519_DestructObject(LTHardwareCryptoEd25519 *instance) {
    LT_UNUSED(instance);
}

static bool LTHardwareCryptoEd25519_ConstructObject(LTHardwareCryptoEd25519 *instance) {
    LT_UNUSED(instance);
    return true;
}

define_LTObjectImplPublic(LTDriverCryptoEd25519, LTHardwareCryptoEd25519,
    GenPublicKey,
    Sign,
    Verify,
);

/*******************************************************************************
 *  LOG
 *******************************************************************************
 *  28-May-22   gallienus   created
 */